import { writable } from 'svelte/store';

export const hbodyofset = writable(0);
export const hmainofset = writable(0);
export const hcatalogofset = writable(0);
export const hpartnersofset = writable(0);
export const hthanksofset = writable(0);
export const horderofset = writable(0);
export const hcontactsofset = writable(0);

let publicPath = `https://dm-parf.github.io/sphere/`;

export const catalogdata = writable(
[
    {dropdown: "СТРОЙМАТЕРИАЛЫ",
        img: `${publicPath}/images/catalog/2.png`,
        subMenus: [
            {
                id: 1,
                subDropdown: "БИТУМНЫЕ МАТЕРИАЛЫ",
                subMenuLinks: []
            },
            {
                id: 2,
                subDropdown: "ГИПСОВЫЕ МАТЕРИАЛЫ",
                subMenuLinks: [
                    "Гипсовое волокно",
                    "Гипсокартон (ГКЛ)"
                ]
            },
            {
                id: 3,
                subDropdown: "ГАЗОБЕТОННЫЕ И СТЕНОВЫЕ СТРОИТЕЛЬНЫЕ БЛОКИ",
                subMenuLinks: [
                    "Газосиликатные блоки",
                    "Позагребневые плиты (ПГП)"
                ]
            },
            {
                id: 4,
                subDropdown: "ТЕПЛОИЗОЛЯЦИЯ",
                subMenuLinks: [
                    "Базальтовая вата",
                    "Экструдированный пенополистерол (XPS)",
                    "Пенопласт",
                    "Стекловолокно",
                    "Вспененный поли"
                ]
            },
            {
                id: 5,
                subDropdown: "ИЗОЛЯЦИОННЫЕ МАТЕРИАЛЫ",
                subMenuLinks: [
                    "Геотекстиль",
                    "Гидроизоляция для дома",
                    "Пароизоляция для дома",
                    "Пленки, мембраны, ленты, клеи"
                ]
            },
            {
                id: 6,
                subDropdown: "КЕРАМЗИТ",
                subMenuLinks: []
            },
            {
                id: 7,
                subDropdown: "КОМПЛЕКТУЮЩИЕ ДЛЯ ШТУКАТУРНЫХ ФАСАДОВ",
                subMenuLinks: []
            },
            {
                id: 8,
                subDropdown: "ЛИСТОВЫЕ МАТЕРИАЛЫ",
                subMenuLinks: [
                    "Лист стекломагниевый (СМЛ)",
                    "Цементно-стружечная плита (ЦСП)"
                ]
            },
            {
                id: 9,
                subDropdown: "МАТЕРИАЛЫ ИЗ ДРЕВЕСИНЫ",
                subMenuLinks: [
                    "Древесно-волокнистая плита (ДВП)",
                    "Ориентированно-стружечная плита (OSB)", 
                    "Пиломатериалы",
                    "Фанера",
                    "Доска обрезная",
                    "Брус обрезной",
                    "Доска строганая"
                ]
            },
            {
                id: 10,
                subDropdown: "МОНТАЖНЫЕ МАТЕРИАЛЫ",
                subMenuLinks: [
                    "Герметики",
                    "Клеи-герметики",
                    "Мастики, праймеры",
                    "Очиститель монтажной пены",
                    "Пены монтажные"
                ]
            },
            {
                id: 11,
                subDropdown: "ПРОФИЛИ И КОМПЛЕКТУЮЩИЕ",
                subMenuLinks: [
                    "Комплектующие для профиля",
                    "Люк для гипсокартона",
                    "Профиль для гипсокартона",
                    "Профиль маячковый",
                    "Профиль угловой",
                    "Подвесы, соединители"
                ]
            },
            {
                id: 12,
                subDropdown: "РЕМОНТ, ЗАЩИТА И ГОДРОИЗОЛЯЦИЯ БЕТОНА",
                subMenuLinks: [
                    "Добавки для сухих смесей",
                    "Составы ремонтные",
                    "Составы гидроизоляционные"
                ]
            },
            {
                id: 13,
                subDropdown: "СТРОИТЕЛЬНЫЕ ЛЕНТЫ, СЕТКИ И СЕРПЯНКИ",
                subMenuLinks: [
                    "Сетки защитные",
                    "Сетки стеклотканевые",
                    "Сетка ЦПВС",
                    "Сетка сварная",
                    "Сетка базальтовая",
                    "Проволока вязальная"
                ]
            },
            {
                id: 14,
                subDropdown: "СУХИЕ СМЕСИ",
                subMenuLinks: [
                    "Шпаклевка",
                    "Штукатурка",
                    "Грунтовка",
                    "Затирка",
                    "Кладочные смеси",
                    "Цемент",
                    "Наливной пол",
                    "Плиточный клей"
                ]
            }
        ]
    },
    {dropdown: "ОТДЕЛОЧНЫЕ МАТЕРИАЛЫ",
        img: `${publicPath}/images/catalog/3.png`,
        subMenus: [
            {
                id: 1,
                subDropdown: "ДЕКОРАТИВНО-ОТДЕЛОЧНЫЕ МАТЕРИАЛЫ",
                subMenuLinks: [
                    "Плинтус напольный, потолочный",
                    "Подоконники",
                    "Сайдинг",
                    "Фурнитура к плитке"
                ]
            },
            {
                id: 2,
                subDropdown: "ДВЕРИ, ОКНА",
                subMenuLinks: []
            },
            {
                id: 3,
                subDropdown: "КЕРАМИЧЕСКАЯ ПЛИТКА И КЕРАМОГРАНИТ",
                subMenuLinks: []
            },
            {
                id: 4,
                subDropdown: "ЛАКОКРАСОЧНЫЕ МАТЕРИАЛЫ",
                subMenuLinks: [
                    "Краска",
                    "Лак",
                    "Антисептик",
                    "Биозащита",
                    "Растворитель",
                    "Жидкое стекло"
                ]
            },
            {
                id: 5,
                subDropdown: "НАПОЛЬНЫЕ ПОКРЫТИЯ",
                subMenuLinks: [
                    "Ламинат",
                    "Линолеум",
                    "Плитка ПВХ",
                    "Подложка"
                ]
            },
            {
                id: 6,
                subDropdown: "ОБОИ",
                subMenuLinks: [
                    "Клей обойный",
                    "Обои бумажные",
                    "Обои виниловые",
                    "Обои под покраску",
                    "Стеклообои",
                    "Стеклохолст молярный"
                ]
            },
            {
                id: 7,
                subDropdown: "ПОДВЕСНЫЕ ПОТОЛКИ",
                subMenuLinks: [
                    "Каркасы для подвесных потолков",
                    "Кассетные потолки",
                    "Подвесные потолки Грильято"
                ]
            }
        ]
    },
    {dropdown: "ИНСТРУМЕНТЫ И ОБОРУДОВАНИЕ",
        img: `${publicPath}/images/catalog/6.png`,
        subMenus: [
            {
                id: 1,
                subDropdown: "ИЗМЕРИТЕЛЬНЫЙ ИНСТРУМЕНТ",
                subMenuLinks: [
                    "Гидроуровни",
                    "Дальномеры",
                    "Линейки, угольники",
                    "Нивелиры",
                    "Рулетки",
                    "Штангенциркули"
                ]
            },
            {
                id: 2,
                subDropdown: "МОЛЯРНО-ШТУКАТУРНЫЙ ИНСТРУМЕНТ",
                subMenuLinks: [
                    "Ленты молярные",
                    "Ролики",
                    "Емкости строительные",
                    "Гладилки",
                    "Кельмы, мастерки",
                    "Кисти молярные",
                    "Краскораспылители",
                    "Насадки для строительных миксеров",
                    "Терки штукатурные",
                    "Шпатели"
                ]
            },
            {
                id: 3,
                subDropdown: "ОПАЛУБКА",
                subMenuLinks: [
                    "Комплектующие для опалубки",
                    "Балка фанеродеревянная",
                    "Фиксаторы арматуры",
                    "Унивилка",
                    "Тренога",
                    "Фиксатор бетонный",
                    "Щиты опалубки"
                ]
            },
            {
                id: 4,
                subDropdown: "РАСХОДНЫЕ МАТЕРИАЛЫ",
                subMenuLinks: [
                    "Лезвия для скребков",
                    "Полотна для скобельной плиты",
                    "Биты",
                    "Запчасти и комплектующие для электроинструмента",
                    "Инструмент для резки и шлифования",
                    "Лезвия сменные сегментированные",
                    "Обтирочные материалы",
                    "Полотна для ножовок",
                    "Полотна для электролобзика",
                    "Сверла, буры, коронки, ударный инструмент",
                    "Скобы",
                    "Стрежни клеевые"
                ]
            },
            {
                id: 5,
                subDropdown: "РУЧНОЙ ИНСТРУМЕНТ",
                subMenuLinks: []
            },
            {
                id: 6,
                subDropdown: "САДОВО-ОГОРОДНЫЙ ИНСТРУМЕНТ",
                subMenuLinks: [
                    "Грабли",
                    "Шланги",
                    "Насосы",
                    "Ведра оцинкованные",
                    "Лопаты",
                    "Снегоуборочный инвентарь",
                    "Черенки"
                ]
            },
            {
                id: 7,
                subDropdown: "СВАРОЧНОЕ ОБОРУДОВАНИЕ",
                subMenuLinks: []
            },
            {
                id: 8,
                subDropdown: "СРЕДСТВА ЗАЩИТЫ ТРУДА",
                subMenuLinks: [
                    "Дождевики",
                    "Жилеты сигнальные, каски",
                    "Защита зрения, лица, слуха",
                    "Защита органов дыхания",
                    "Защита рук",
                    "Одежда защитная",
                    "Пояса страховочные"
                ]
            },
            {
                id: 9,
                subDropdown: "СТОЛЯРНО-СЛЕСАРНЫЙ ИНСТРУМЕНТ",
                subMenuLinks: [
                    "Ножовки и пилы",
                    "Топоры, стамески и долото",
                    "Рубанки",
                    "Отвертки",
                    "Гвоздодеры",
                    "Молотки, кувалды, киянки",
                    "Болторезы, трубогиб"
                ]
            },
            {
                id: 10,
                subDropdown: "СТРОИТЕЛЬНО-ОТДЕЛОЧНЫЙ ИНСТРУМЕНТ",
                subMenuLinks: [
                    "Крепежный инструмент",
                    "Инструмент для работы с арматурой",
                    "Заклепочники",
                    "Инструмент для кафеля и стекла",
                    "Инструмент для работы с гипсокартоном",
                    "Инструмент для работы с пеногазобетоном",
                    "Ножи, скрепки",
                    "Пистолеты для герметика",
                    "Пистолеты для монтажной пены"
                ]
            },
            {
                id: 11,
                subDropdown: "СТРОИТЕЛЬНОЕ ОБОРУДОВАНИЕ",
                subMenuLinks: [
                    "Бетоносмесители",
                    "Лестницы, стремянки",
                    "Тачки строительные"
                ]
            },
            {
                id: 12,
                subDropdown: "ТЕПЛОВОЕ ОБОРУДОВАНИЕ",
                subMenuLinks: [
                    "Тепловентиляторы",
                    "Обогреватели",
                    "Тепловые завесы",
                    "Камины"
                ]
            },
            {
                id: 13,
                subDropdown: "ХОЗЯЙСТВЕННЫЕ ТОВАРЫ",
                subMenuLinks: [
                    "Шпагаты",
                    "Ручки для швабр",
                    "Замки навесные",
                    "Ножницы бытовые",
                    "Пакеты и мешки для мусора",
                    "Пленка защитная",
                    "Щетки, метлы, веники, совки, швабры для уборки"
                ]
            },
            {
                id: 14,
                subDropdown: "ЭЛЕКТРО-БЕНЗООБОРУДОВАНИЕ",
                subMenuLinks: [
                    "Бензопилы",
                    "Генераторы",
                    "Компрессоры",
                    "Мотопомпы"
                ]
            },
            {
                id: 15,
                subDropdown: "ЭЛЕКТРОИНСТРУМЕНТ",
                subMenuLinks: [
                    "Дрели",
                    "Деревообробатывающие инструменты",
                    "Перфораторы",
                    "Пылесосы промышленные",
                    "Шлифовальные машины",
                    "Краскопульты",
                    "Лобзики",
                    "Миксеры",
                    "Циркулярки",
                    "Штроборезы",
                    "Фены технические"
                ]
            },
        ]
    },
    {dropdown: "КРЕПЕЖНЫЕ СИСТЕМЫ",
        img: `${publicPath}//images/catalog/5.png`,
        subMenus: [
            {
                id: 1,
                subDropdown: "САМОРЕЗЫ, ШУРУПЫ",
                subMenuLinks: []
            },
            {
                id: 2,
                subDropdown: "ФАСОВАННЫЙ КЕРЕПЕЖ",
                subMenuLinks: [
                    "Саморезы",
                    "Дюбели",
                    "Гвозди",
                    "Метрический крепеж",
                    "Анкеры",
                    "Грузовой крепеж"
                ]
            },
            {
                id: 3,
                subDropdown: "ДЮБЕЛЬНАЯ ТЕХНИКА",
                subMenuLinks: []
            },
            {
                id: 4,
                subDropdown: "АНКЕРНАЯ ТЕХНИКА",
                subMenuLinks: []
            },
            {
                id: 5,
                subDropdown: "МЕТРИЧЕСКИЙ КРЕПЕЖ",
                subMenuLinks: [
                    "Болты",
                    "Винты",
                    "Гайки",
                    "Шайбы",
                    "Шпильки"
                ]
            },
            {
                id: 6,
                subDropdown: "ГВОЗДИ",
                subMenuLinks: []
            },
            {
                id: 7,
                subDropdown: "ПЕРФОРИРОВАННЫЙ КРЕПЕЖ",
                subMenuLinks: []
            },
            {
                id: 8,
                subDropdown: "ЭЛЕКТРОМОНТАЖНЫЙ КРЕПЕЖ",
                subMenuLinks: [
                    "Клипса для крепления труб",
                    "Кабельные стяжки пластиковые",
                    "Скоба металлическая",
                    "Скоба пластиковая с гвоздем"
                ]
            },
            {
                id: 9,
                subDropdown: "САНТЕХНИЧЕСКИЙ КРЕПЕЖ",
                subMenuLinks: [
                    "Хомуты"
                ]
            },
            {
                id: 10,
                subDropdown: "ВЕНТИЛЯЦИОННЫЙ КРЕПЕЖ",
                subMenuLinks: [
                    "Болт U-образный",
                    "Траверсы",
                    "Крепеж для воздуховодов",
                    "Профили",
                    "Кронштейн",
                    "Хомуты",
                    "Шина монтажная",
                    "Уголки для воздуховодов",
                    "Скоба для воздуховодов",
                    "Струбцина монтажная",
                    "Пластина с гайкой",
                    "Шипы самоклеящиеся для крепления изоляции",
                    "Лента уплотнительная",
                    "Лента клейкая алюминиевая, армированная"
                ]
            },
            {
                id: 11,
                subDropdown: "КРЕПЕЖ КРОВЕЛЬНЫХ МАТЕРИАЛОВ",
                subMenuLinks: [
                    "Дюбели кровельные",
                    "Саморезы с антикоррозийным покрытием РОКС",
                    "Планки и шайбы РОСК распределители нагрузок"
                ]
            },
            {
                id: 12,
                subDropdown: "СТРОПЫ, ЗАХВАТЫ ДЛЯ ГРУЗОВ",
                subMenuLinks: [
                    "Опора забивная",
                    "Сваи",
                    "Фланцы"
                ]
            }
        ]
    },
    {dropdown: "ЭЛЕКТРИКА И СВЕТ",
        img: `${publicPath}/images/catalog/4.png`,
        subMenus: [
            {
                id: 1,
                subDropdown: "КАБЕЛЬ И ПРОВОД",
                subMenuLinks: [
                    "Кабели силовые специальные",
                    "Кабель греющий",
                    "Аксессуары к кабелям и проводам",
                    "Кабели и провода связи",
                    "Кабели и провода силовые для нестационарной прокладки",
                    "Кабели и провода силовые для стационарной прокладки",
                    "Провода для воздушных линий электропередач (СИП)",
                    "Провода силовые (ПВ1, ПВ3, ПАВ/АПВ)"
                ]
            },
            {
                id: 2,
                subDropdown: "ОСВЕЩЕНИЕ",
                subMenuLinks: [
                    "Лампы, патроны",
                    "Аксессуары и комплектующие для светильников",
                    "Ленты светодиодные, аксессуары",
                    "Светильники",
                    "Прожекторы",
                    "Фонари и переносные световые приборы"
                ]
            },
            {
                id: 3,
                subDropdown: "РОЗЕТКИ И ВЫКЛЮЧАТЕЛИ",
                subMenuLinks: []
            },
            {
                id: 4,
                subDropdown: "СВЕТОДИОДНОЕ ОСВЕЩЕНИЕ",
                subMenuLinks: []
            },
            {
                id: 5,
                subDropdown: "ЩИТОВОЕ ОБОРУДОВАНИЕ",
                subMenuLinks: []
            }
        ]
    },
    {dropdown: "ТОВАРЫ ДЛЯ ДОМА И САДА ",
        img: `${publicPath}/images/catalog/7.png`,
        subMenus: [
            {
                id: 1,
                subDropdown: "АНТИСЕПТИКИ",
                subMenuLinks: []
            },
            {
                id: 2,
                subDropdown: "ПЕРЧАТКИ ЗАЩИТНЫЕ",
                subMenuLinks: []
            }
        ]
    }
]
);